drik245/LPC1768-CAN-Driver/src/drivers/can_driver.c
/**
 * @file can_driver.c
 * @brief CAN Driver implementation for LPC1768
 *
 * Week 2 — Register-level init, transmit, receive, filtering,
 *          status, mode control, ISR, and callback dispatch.
 * Week 3 — Diagnostics, group filters, bus-off recovery,
 *          sleep/wake power management.
 */

#include "LPC17xx.h"
#include "can_driver.h"
#include "can_buffer.h"
#include "can_hal.h"
#include "can_reg.h"
#include <string.h>

/* ================================================================
 *  Internal Constants
 * ================================================================ */

#define CAN_NUM_CHANNELS     2
#define MAX_STD_FILTERS      16
#define MAX_EXT_FILTERS      8
#define MAX_STD_GRP_FILTERS  8
#define MAX_EXT_GRP_FILTERS  4
#define BUSOFF_RECOVERY_MS   500   /* auto-recovery delay */

/* ================================================================
 *  Internal State
 * ================================================================ */

/** Diagnostic counters (per channel) */
typedef struct {
    uint32_t    tx_count;
    uint32_t    rx_count;
    uint32_t    tx_err_frames;
    uint32_t    rx_err_frames;
    uint32_t    bus_off_count;
    uint32_t    overrun_count;
    uint32_t    arb_lost_count;
    can_error_t last_error;
    uint32_t    init_tick;       /* g_tick at init time */
} can_diag_internal_t;

/** Per-channel runtime context */
typedef struct {
    bool                 initialized;
    bool                 timestamp_en;
    can_rx_callback_t    rx_cb;
    can_error_callback_t err_cb;
    can_rx_buffer_t      rx_buf;
    can_tx_buffer_t      tx_buf;
    can_diag_internal_t  diag;
    bool                 busoff_recovery;  /* auto-recovery armed     */
    uint32_t             busoff_tick;      /* tick when bus-off seen  */
} can_ctx_t;

/** Individual filter entry */
typedef struct {
    uint32_t id;
    uint8_t  channel;
    bool     active;
} can_filter_t;

/** Group (range) filter entry */
typedef struct {
    uint32_t id_low;
    uint32_t id_high;
    uint8_t  channel;
    bool     active;
} can_group_filter_t;

static can_ctx_t          g_ctx[CAN_NUM_CHANNELS];
static can_filter_t       g_sff[MAX_STD_FILTERS];
static can_filter_t       g_eff[MAX_EXT_FILTERS];
static uint8_t            g_num_sff;
static uint8_t            g_num_eff;
static can_group_filter_t g_sff_grp[MAX_STD_GRP_FILTERS];
static can_group_filter_t g_eff_grp[MAX_EXT_GRP_FILTERS];
static uint8_t            g_num_sff_grp;
static uint8_t            g_num_eff_grp;
static bool               g_filters_active;

/** Global millisecond tick — call can_timestamp_tick() from 1 ms timer */
static volatile uint32_t g_tick;

/* ================================================================
 *  Helper — get peripheral pointer
 * ================================================================ */

static LPC_CAN_TypeDef *can_periph(can_channel_t ch)
{
    return (ch == CAN_CHANNEL_1) ? LPC_CAN1 : LPC_CAN2;
}

/* ================================================================
 *  Baud-rate → BTR register value
 *
 *  PCLK = CCLK = 100 MHz (set by HAL).
 *  Target: 80 % sample point, SJW = 4 Tq.
 *
 *  Nq (quanta/bit) = PCLK / (BRP+1) / baud
 *  We pick BRP so that Nq = 20:
 *    TSEG1 + 1 = 15  → 15 Tq  (prop + phase1)
 *    TSEG2 + 1 =  4  →  4 Tq  (phase2)
 *    SYNC      =  1  →  1 Tq
 *    Total     = 20 Tq   Sample point = 16/20 = 80 %
 * ================================================================ */

static int can_calc_btr(can_baudrate_t baud, uint32_t *btr)
{
    uint32_t pclk = can_hal_get_pclk();
    uint32_t brp;

    /* BRP+1 = PCLK / (baud * Nq)   with Nq = 20 */
    uint32_t brp_val = pclk / ((uint32_t)baud * 20U);
    if (brp_val == 0 || brp_val > 1024) return CAN_ERR_INVALID_PARAM;

    brp = brp_val - 1U;

    /* SJW=3 (4 Tq), TSEG1=14 (15 Tq), TSEG2=3 (4 Tq), SAM=0 */
    *btr = (brp & 0x3FFU)
         | (3U  << 14)          /* SJW  */
         | (14U << 16)          /* TSEG1 */
         | (3U  << 20);         /* TSEG2 */

    return CAN_OK;
}

/* ================================================================
 *  Acceptance Filter helpers
 * ================================================================ */

/** Sort filter array by (channel, id) for AF table ordering */
static void sort_filters(can_filter_t *arr, uint8_t n)
{
    uint8_t i, j;
    for (i = 1; i < n; i++) {
        can_filter_t tmp = arr[i];
        j = i;
        while (j > 0) {
            uint32_t key_j   = ((uint32_t)arr[j-1].channel << 29) | arr[j-1].id;
            uint32_t key_tmp = ((uint32_t)tmp.channel << 29) | tmp.id;
            if (key_j <= key_tmp) break;
            arr[j] = arr[j-1];
            j--;
        }
        arr[j] = tmp;
    }
}

/** Sort group-filter array by (channel, id_low) */
static void sort_group_filters(can_group_filter_t *arr, uint8_t n)
{
    uint8_t i, j;
    for (i = 1; i < n; i++) {
        can_group_filter_t tmp = arr[i];
        j = i;
        while (j > 0) {
            uint32_t key_j   = ((uint32_t)arr[j-1].channel << 29) | arr[j-1].id_low;
            uint32_t key_tmp = ((uint32_t)tmp.channel << 29) | tmp.id_low;
            if (key_j <= key_tmp) break;
            arr[j] = arr[j-1];
            j--;
        }
        arr[j] = tmp;
    }
}

/** Rebuild the AF RAM table from all filter lists */
static void af_rebuild(void)
{
    uint32_t idx = 0;
    uint8_t  i;

    LPC_CANAF->AFMR = CAN_AFMR_ACCOFF;

    /* ── 1. Standard Individual (2 per word) ───────────── */
    uint32_t sff_sa = idx * 4;
    sort_filters(g_sff, g_num_sff);
    for (i = 0; i < g_num_sff; i += 2) {
        uint16_t e1 = ((uint16_t)(g_sff[i].channel & 0x7) << 13)
                     | ((uint16_t)(g_sff[i].id & 0x7FF) << 1);
        uint16_t e2 = 0xFFFF;
        if ((i + 1) < g_num_sff)
            e2 = ((uint16_t)(g_sff[i+1].channel & 0x7) << 13)
               | ((uint16_t)(g_sff[i+1].id & 0x7FF) << 1);
        LPC_CANAF_RAM->mask[idx++] = ((uint32_t)e1 << 16) | e2;
    }

    /* ── 2. Standard Group (1 pair per word) ────────────── */
    uint32_t sff_grp_sa = idx * 4;
    sort_group_filters(g_sff_grp, g_num_sff_grp);
    for (i = 0; i < g_num_sff_grp; i++) {
        uint16_t lo = ((uint16_t)(g_sff_grp[i].channel & 0x7) << 13)
                    | ((uint16_t)(g_sff_grp[i].id_low  & 0x7FF) << 1);
        uint16_t hi = ((uint16_t)(g_sff_grp[i].channel & 0x7) << 13)
                    | ((uint16_t)(g_sff_grp[i].id_high & 0x7FF) << 1);
        LPC_CANAF_RAM->mask[idx++] = ((uint32_t)lo << 16) | hi;
    }

    /* ── 3. Extended Individual (1 per word) ────────────── */
    uint32_t eff_sa = idx * 4;
    sort_filters(g_eff, g_num_eff);
    for (i = 0; i < g_num_eff; i++) {
        LPC_CANAF_RAM->mask[idx++] =
            ((uint32_t)(g_eff[i].channel & 0x7) << 29)
            | (g_eff[i].id & 0x1FFFFFFFU);
    }

