drik245/LPC1768-CAN-Driver/src/drivers/can_driver.c
    /* ── 4. Extended Group (2 words per entry) ──────────── */
    uint32_t eff_grp_sa = idx * 4;
    sort_group_filters(g_eff_grp, g_num_eff_grp);
    for (i = 0; i < g_num_eff_grp; i++) {
        LPC_CANAF_RAM->mask[idx++] =
            ((uint32_t)(g_eff_grp[i].channel & 0x7) << 29)
            | (g_eff_grp[i].id_low & 0x1FFFFFFFU);
        LPC_CANAF_RAM->mask[idx++] =
            ((uint32_t)(g_eff_grp[i].channel & 0x7) << 29)
            | (g_eff_grp[i].id_high & 0x1FFFFFFFU);
    }

    uint32_t end_of_tbl = idx * 4;

    LPC_CANAF->SFF_sa     = sff_sa;
    LPC_CANAF->SFF_GRP_sa = sff_grp_sa;
    LPC_CANAF->EFF_sa     = eff_sa;
    LPC_CANAF->EFF_GRP_sa = eff_grp_sa;
    LPC_CANAF->ENDofTable = end_of_tbl;

    LPC_CANAF->AFMR = 0;
    g_filters_active = true;
}

/* Forward declaration — defined in ISR section below */
static void busoff_recovery_check(void);

/* ================================================================
 *  Timestamp
 * ================================================================ */

void can_timestamp_tick(void)
{
    g_tick++;
    busoff_recovery_check();
}

static uint32_t get_timestamp(can_channel_t ch)
{
    return g_ctx[ch].timestamp_en ? g_tick : 0;
}

/* ================================================================
 *  PUBLIC API
 * ================================================================ */

/* ── Init ──────────────────────────────────────────────────── */

int can_init(const can_config_t *config)
{
    if (!config) return CAN_ERR_INVALID_PARAM;

    can_channel_t ch = config->channel;
    if (ch > CAN_CHANNEL_2) return CAN_ERR_INVALID_PARAM;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);
    can_ctx_t *ctx = &g_ctx[ch];

    /* HAL setup */
    int rc = can_hal_init_clock(ch);
    if (rc != CAN_OK) return rc;

    rc = can_hal_init_pins(ch);
    if (rc != CAN_OK) return rc;

    /* Enter Reset Mode */
    pCAN->MOD = CAN_MOD_RM;

    /* Baud rate */
    uint32_t btr;
    rc = can_calc_btr(config->baudrate, &btr);
    if (rc != CAN_OK) return rc;
    pCAN->BTR = btr;

    /* Error Warning Limit — default 96 */
    pCAN->EWL = 96;

    /* Clear status by reading ICR */
    (void)pCAN->ICR;

    /* Enable interrupts: RX, TX1/2/3, Error Warning, Bus Error,
       Error Passive, Data Overrun */
    pCAN->IER = CAN_IER_RIE  | CAN_IER_TIE1 | CAN_IER_TIE2
              | CAN_IER_TIE3 | CAN_IER_EIE  | CAN_IER_BEIE
              | CAN_IER_EPIE | CAN_IER_DOIE;

    /* Default: Acceptance Filter in Bypass (accept all) */
    if (!g_filters_active) {
        LPC_CANAF->AFMR = CAN_AFMR_ACCBP;
    }

    /* Initialise context */
    memset(ctx, 0, sizeof(*ctx));
    ctx->rx_cb       = config->rx_callback;
    ctx->err_cb      = config->error_callback;
    ctx->timestamp_en = config->enable_timestamp;
    ctx->diag.init_tick = g_tick;
    ctx->initialized = true;

    /* Set operating mode */
    rc = can_set_mode(ch, config->mode);
    if (rc != CAN_OK) return rc;

    /* Enable shared CAN NVIC IRQ */
    can_hal_enable_irq();

    return CAN_OK;
}

/* ── Deinit ────────────────────────────────────────────────── */

int can_deinit(can_channel_t ch)
{
    if (ch > CAN_CHANNEL_2)       return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized)   return CAN_ERR_NOT_INIT;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);

    pCAN->MOD = CAN_MOD_RM;      /* enter reset */
    pCAN->IER = 0;                /* disable all CAN IRQs */

    can_hal_deinit_clock(ch);
    memset(&g_ctx[ch], 0, sizeof(can_ctx_t));

    return CAN_OK;
}

/* ── Transmit ──────────────────────────────────────────────── */

int can_transmit(can_channel_t ch, const can_message_t *msg)
{
    if (ch > CAN_CHANNEL_2 || !msg)  return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized)       return CAN_ERR_NOT_INIT;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);
    uint32_t sr = pCAN->SR;

    /* Build TFI (Frame Info) word */
    uint32_t tfi = ((uint32_t)(msg->dlc & 0x0F) << CAN_TFI_DLC_SHIFT);
    if (msg->frame_type == CAN_FRAME_EXTENDED) tfi |= CAN_TFI_FF;
    if (msg->rtr)                              tfi |= CAN_TFI_RTR;

    /* Build TID (ID) word */
    uint32_t tid = (msg->frame_type == CAN_FRAME_EXTENDED)
                 ? (msg->id & 0x1FFFFFFFU)
                 : (msg->id & 0x7FFU);

    /* Build TDA / TDB (data) */
    uint32_t tda = (uint32_t)msg->data[0]
                 | ((uint32_t)msg->data[1] << 8)
                 | ((uint32_t)msg->data[2] << 16)
                 | ((uint32_t)msg->data[3] << 24);
    uint32_t tdb = (uint32_t)msg->data[4]
                 | ((uint32_t)msg->data[5] << 8)
                 | ((uint32_t)msg->data[6] << 16)
                 | ((uint32_t)msg->data[7] << 24);

    /* Pick the first available HW TX buffer (1, 2, or 3) */
    uint32_t cmr_select;
    if (sr & CAN_SR_TBS1) {
        pCAN->TFI1 = tfi;  pCAN->TID1 = tid;
        pCAN->TDA1 = tda;  pCAN->TDB1 = tdb;
        cmr_select = CAN_CMR_STB1;
    } else if (sr & CAN_SR_TBS2) {
        pCAN->TFI2 = tfi;  pCAN->TID2 = tid;
        pCAN->TDA2 = tda;  pCAN->TDB2 = tdb;
        cmr_select = CAN_CMR_STB2;
    } else if (sr & CAN_SR_TBS3) {
        pCAN->TFI3 = tfi;  pCAN->TID3 = tid;
        pCAN->TDA3 = tda;  pCAN->TDB3 = tdb;
        cmr_select = CAN_CMR_STB3;
    } else {
        /* All HW buffers busy — queue in software TX ring buffer */
        if (!can_tx_buffer_push(&g_ctx[ch].tx_buf, msg))
            return CAN_ERR_BUFFER_FULL;
        return CAN_OK;
    }

    /* Trigger transmission (use SRR in self-test mode) */
    if (pCAN->MOD & CAN_MOD_STM)
        pCAN->CMR = CAN_CMR_SRR | cmr_select;
    else
        pCAN->CMR = CAN_CMR_TR  | cmr_select;

    return CAN_OK;
}

/* ── Receive (polling with timeout) ────────────────────────── */

int can_receive(can_channel_t ch, can_message_t *msg, uint32_t timeout_ms)
{
    if (ch > CAN_CHANNEL_2 || !msg)  return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized)       return CAN_ERR_NOT_INIT;

    /* First try the ISR-filled ring buffer */
    if (can_buffer_pop(&g_ctx[ch].rx_buf, msg))
        return CAN_OK;

