drik245/LPC1768-CAN-Driver/src/drivers/can_driver.c
    /* Polling fallback — spin until data or timeout */
    LPC_CAN_TypeDef *pCAN = can_periph(ch);
    volatile uint32_t start = g_tick;

    while ((g_tick - start) < timeout_ms) {
        if (pCAN->GSR & CAN_GSR_RBS) {
            uint32_t rfs = pCAN->RFS;
            uint32_t rid = pCAN->RID;
            uint32_t rda = pCAN->RDA;
            uint32_t rdb = pCAN->RDB;

            msg->frame_type = (rfs & CAN_RFS_FF) ? CAN_FRAME_EXTENDED
                                                  : CAN_FRAME_STANDARD;
            msg->id  = (msg->frame_type == CAN_FRAME_EXTENDED)
                     ? (rid & 0x1FFFFFFFU) : (rid & 0x7FFU);
            msg->rtr = (rfs & CAN_RFS_RTR) ? true : false;
            msg->dlc = (rfs & CAN_RFS_DLC_MASK) >> CAN_RFS_DLC_SHIFT;

            msg->data[0] = (uint8_t)(rda);
            msg->data[1] = (uint8_t)(rda >> 8);
            msg->data[2] = (uint8_t)(rda >> 16);
            msg->data[3] = (uint8_t)(rda >> 24);
            msg->data[4] = (uint8_t)(rdb);
            msg->data[5] = (uint8_t)(rdb >> 8);
            msg->data[6] = (uint8_t)(rdb >> 16);
            msg->data[7] = (uint8_t)(rdb >> 24);

            msg->timestamp = get_timestamp(ch);

            /* Release HW receive buffer */
            pCAN->CMR = CAN_CMR_RRB;
            return CAN_OK;
        }
    }

    return CAN_ERR_TIMEOUT;
}

/* ── Filter ────────────────────────────────────────────────── */

int can_set_filter(can_channel_t ch, uint32_t id, uint32_t mask,
                   can_frame_type_t ft)
{
    if (ch > CAN_CHANNEL_2)  return CAN_ERR_INVALID_PARAM;
    (void)mask;       /* HW individual entry = exact match only */

    if (ft == CAN_FRAME_STANDARD) {
        if (g_num_sff >= MAX_STD_FILTERS) return CAN_ERR_FILTER_FULL;
        g_sff[g_num_sff].id      = id & 0x7FFU;
        g_sff[g_num_sff].channel = (uint8_t)ch;
        g_sff[g_num_sff].active  = true;
        g_num_sff++;
    } else {
        if (g_num_eff >= MAX_EXT_FILTERS) return CAN_ERR_FILTER_FULL;
        g_eff[g_num_eff].id      = id & 0x1FFFFFFFU;
        g_eff[g_num_eff].channel = (uint8_t)ch;
        g_eff[g_num_eff].active  = true;
        g_num_eff++;
    }

    af_rebuild();
    return CAN_OK;
}

/* ── Status ────────────────────────────────────────────────── */

int can_get_status(can_channel_t ch, can_status_t *status)
{
    if (ch > CAN_CHANNEL_2 || !status) return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized)         return CAN_ERR_NOT_INIT;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);
    uint32_t gsr = pCAN->GSR;

    status->tx_error_count = (uint8_t)((gsr & CAN_GSR_TXERR_MASK) >> CAN_GSR_TXERR_SHIFT);
    status->rx_error_count = (uint8_t)((gsr & CAN_GSR_RXERR_MASK) >> CAN_GSR_RXERR_SHIFT);
    status->bus_off        = (gsr & CAN_GSR_BS) ? true : false;
    status->error_warning  = (gsr & CAN_GSR_ES) ? true : false;
    status->tx_pending     = (gsr & CAN_GSR_TS) ? true : false;
    status->rx_available   = (gsr & CAN_GSR_RBS) ? true : false;

    return CAN_OK;
}

/* ── Mode ──────────────────────────────────────────────────── */

int can_set_mode(can_channel_t ch, can_mode_t mode)
{
    if (ch > CAN_CHANNEL_2) return CAN_ERR_INVALID_PARAM;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);

    switch (mode) {
    case CAN_MODE_NORMAL:
        pCAN->MOD &= ~(CAN_MOD_RM | CAN_MOD_LOM | CAN_MOD_STM);
        break;
    case CAN_MODE_LISTEN:
        pCAN->MOD |=  CAN_MOD_LOM;
        pCAN->MOD &= ~CAN_MOD_RM;
        break;
    case CAN_MODE_SELFTEST:
        pCAN->MOD |=  CAN_MOD_STM;
        pCAN->MOD &= ~CAN_MOD_RM;
        break;
    case CAN_MODE_RESET:
        pCAN->MOD |=  CAN_MOD_RM;
        break;
    default:
        return CAN_ERR_INVALID_PARAM;
    }

    return CAN_OK;
}

/* ── Callbacks ─────────────────────────────────────────────── */

int can_register_rx_callback(can_channel_t ch, can_rx_callback_t cb)
{
    if (ch > CAN_CHANNEL_2) return CAN_ERR_INVALID_PARAM;
    g_ctx[ch].rx_cb = cb;
    return CAN_OK;
}

int can_register_error_callback(can_channel_t ch, can_error_callback_t cb)
{
    if (ch > CAN_CHANNEL_2) return CAN_ERR_INVALID_PARAM;
    g_ctx[ch].err_cb = cb;
    return CAN_OK;
}

/* ================================================================
 *  ISR  — shared by CAN1 and CAN2
 * ================================================================ */

/** Read one frame from hardware RX buffer into msg struct */
static void isr_read_rx(LPC_CAN_TypeDef *pCAN, can_channel_t ch)
{
    can_ctx_t *ctx = &g_ctx[ch];

    while (pCAN->GSR & CAN_GSR_RBS) {
        can_message_t msg;

        uint32_t rfs = pCAN->RFS;
        uint32_t rid = pCAN->RID;
        uint32_t rda = pCAN->RDA;
        uint32_t rdb = pCAN->RDB;

        msg.frame_type = (rfs & CAN_RFS_FF) ? CAN_FRAME_EXTENDED
                                             : CAN_FRAME_STANDARD;
        msg.id  = (msg.frame_type == CAN_FRAME_EXTENDED)
                ? (rid & 0x1FFFFFFFU) : (rid & 0x7FFU);
        msg.rtr = (rfs & CAN_RFS_RTR) ? true : false;
        msg.dlc = (uint8_t)((rfs & CAN_RFS_DLC_MASK) >> CAN_RFS_DLC_SHIFT);

        msg.data[0] = (uint8_t)(rda);
        msg.data[1] = (uint8_t)(rda >> 8);
        msg.data[2] = (uint8_t)(rda >> 16);
        msg.data[3] = (uint8_t)(rda >> 24);
        msg.data[4] = (uint8_t)(rdb);
        msg.data[5] = (uint8_t)(rdb >> 8);
        msg.data[6] = (uint8_t)(rdb >> 16);
        msg.data[7] = (uint8_t)(rdb >> 24);

        msg.timestamp = get_timestamp(ch);

        /* Release HW RX buffer */
        pCAN->CMR = CAN_CMR_RRB;

        /* Push into ring buffer */
        can_buffer_push(&ctx->rx_buf, &msg);

        /* User callback (from ISR context) */
        if (ctx->rx_cb)
            ctx->rx_cb(ch, &msg);
    }
}

/** Drain software TX queue into any free HW TX buffer */
static void isr_feed_tx(LPC_CAN_TypeDef *pCAN, can_channel_t ch)
{
    can_ctx_t *ctx = &g_ctx[ch];
    can_message_t msg;

    while (!can_tx_buffer_is_empty(&ctx->tx_buf)) {
        uint32_t sr = pCAN->SR;

        /* Pick a free HW buffer */
        uint32_t cmr_select;
        volatile uint32_t *pTFI, *pTID, *pTDA, *pTDB;

        if (sr & CAN_SR_TBS1) {
            pTFI = &pCAN->TFI1; pTID = &pCAN->TID1;
            pTDA = &pCAN->TDA1; pTDB = &pCAN->TDB1;
            cmr_select = CAN_CMR_STB1;
        } else if (sr & CAN_SR_TBS2) {
            pTFI = &pCAN->TFI2; pTID = &pCAN->TID2;
            pTDA = &pCAN->TDA2; pTDB = &pCAN->TDB2;
            cmr_select = CAN_CMR_STB2;
        } else if (sr & CAN_SR_TBS3) {
            pTFI = &pCAN->TFI3; pTID = &pCAN->TID3;
            pTDA = &pCAN->TDA3; pTDB = &pCAN->TDB3;
            cmr_select = CAN_CMR_STB3;
        } else {
            break;  /* no free buffer */
        }

        can_tx_buffer_pop(&ctx->tx_buf, &msg);

        /* Load frame */
        uint32_t tfi = ((uint32_t)(msg.dlc & 0x0F) << CAN_TFI_DLC_SHIFT);
        if (msg.frame_type == CAN_FRAME_EXTENDED) tfi |= CAN_TFI_FF;
        if (msg.rtr) tfi |= CAN_TFI_RTR;

