drik245/LPC1768-CAN-Driver/src/drivers/can_driver.c
        *pTFI = tfi;
        *pTID = (msg.frame_type == CAN_FRAME_EXTENDED)
              ? (msg.id & 0x1FFFFFFFU) : (msg.id & 0x7FFU);
        *pTDA = (uint32_t)msg.data[0]
              | ((uint32_t)msg.data[1] << 8)
              | ((uint32_t)msg.data[2] << 16)
              | ((uint32_t)msg.data[3] << 24);
        *pTDB = (uint32_t)msg.data[4]
              | ((uint32_t)msg.data[5] << 8)
              | ((uint32_t)msg.data[6] << 16)
              | ((uint32_t)msg.data[7] << 24);

        if (pCAN->MOD & CAN_MOD_STM)
            pCAN->CMR = CAN_CMR_SRR | cmr_select;
        else
            pCAN->CMR = CAN_CMR_TR  | cmr_select;
    }
}

/** Map ICR error-code capture bits to can_error_t */
static can_error_t isr_decode_error(uint32_t icr)
{
    uint32_t errc = (icr & CAN_ICR_ERRC_MASK) >> CAN_ICR_ERRC_SHIFT;
    switch (errc) {
    case 0: return CAN_ERROR_BIT0;
    case 1: return CAN_ERROR_FORM;
    case 2: return CAN_ERROR_STUFF;
    default: return CAN_ERROR_CRC;
    }
}

/** Process all pending interrupts for one channel */
static void isr_process_channel(LPC_CAN_TypeDef *pCAN, can_channel_t ch)
{
    uint32_t icr = pCAN->ICR;
    can_ctx_t *ctx = &g_ctx[ch];

    if (!ctx->initialized) return;

    /* ── Receive ───────────────────────── */
    if (icr & CAN_ICR_RI) {
        isr_read_rx(pCAN, ch);
        ctx->diag.rx_count++;
    }

    /* ── TX complete — feed queued msgs ── */
    if (icr & (CAN_ICR_TI1 | CAN_ICR_TI2 | CAN_ICR_TI3)) {
        ctx->diag.tx_count++;
        isr_feed_tx(pCAN, ch);
    }

    /* ── Data overrun ──────────────────── */
    if (icr & CAN_ICR_DOI) {
        pCAN->CMR = CAN_CMR_CDO;
        ctx->diag.overrun_count++;
    }

    /* ── Arbitration lost ──────────────── */
    if (icr & CAN_ICR_ALI) {
        ctx->diag.arb_lost_count++;
    }

    /* ── Bus error ─────────────────────── */
    if (icr & CAN_ICR_BEI) {
        can_error_t err = isr_decode_error(icr);
        ctx->diag.last_error = err;
        ctx->diag.tx_err_frames++;
        if (ctx->err_cb)
            ctx->err_cb(ch, err);
    }

    /* ── Error Warning / Passive / Bus-off ─ */
    if (icr & (CAN_ICR_EI | CAN_ICR_EPI)) {
        if (pCAN->GSR & CAN_GSR_BS) {
            ctx->diag.bus_off_count++;
            ctx->diag.last_error = CAN_ERROR_BUS_OFF;
            /* Arm bus-off auto-recovery */
            ctx->busoff_recovery = true;
            ctx->busoff_tick     = g_tick;
            if (ctx->err_cb)
                ctx->err_cb(ch, CAN_ERROR_BUS_OFF);
        } else if (pCAN->GSR & CAN_GSR_ES) {
            ctx->diag.rx_err_frames++;
            if (ctx->err_cb)
                ctx->err_cb(ch, CAN_ERROR_ACK);
        }
    }
}

/* ── Bus-off auto-recovery (called from timestamp tick) ───── */

static void busoff_recovery_check(void)
{
    uint8_t i;
    for (i = 0; i < CAN_NUM_CHANNELS; i++) {
        can_ctx_t *ctx = &g_ctx[i];
        if (!ctx->busoff_recovery) continue;
        if ((g_tick - ctx->busoff_tick) >= BUSOFF_RECOVERY_MS) {
            LPC_CAN_TypeDef *pCAN = can_periph((can_channel_t)i);
            /* Toggle reset mode to re-join bus */
            pCAN->MOD |=  CAN_MOD_RM;
            pCAN->MOD &= ~CAN_MOD_RM;
            ctx->busoff_recovery = false;
        }
    }
}

/* ── CAN_IRQHandler — called by NVIC for both CAN1 & CAN2 ── */

void CAN_IRQHandler(void)
{
    isr_process_channel(LPC_CAN1, CAN_CHANNEL_1);
    isr_process_channel(LPC_CAN2, CAN_CHANNEL_2);
}

/* ================================================================
 *  Week 3 — Advanced API
 * ================================================================ */

/* ── Diagnostics ───────────────────────────────────────────── */

int can_get_diag(can_channel_t ch, can_diag_t *diag)
{
    if (ch > CAN_CHANNEL_2 || !diag) return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized)       return CAN_ERR_NOT_INIT;

    can_diag_internal_t *d = &g_ctx[ch].diag;
    diag->tx_count       = d->tx_count;
    diag->rx_count       = d->rx_count;
    diag->tx_err_frames  = d->tx_err_frames;
    diag->rx_err_frames  = d->rx_err_frames;
    diag->bus_off_count  = d->bus_off_count;
    diag->overrun_count  = d->overrun_count;
    diag->arb_lost_count = d->arb_lost_count;
    diag->last_error     = d->last_error;
    diag->uptime_ms      = g_tick - d->init_tick;
    return CAN_OK;
}

void can_reset_diag(can_channel_t ch)
{
    if (ch > CAN_CHANNEL_2) return;
    memset(&g_ctx[ch].diag, 0, sizeof(can_diag_internal_t));
    g_ctx[ch].diag.init_tick = g_tick;
}

/* ── Group Filters ─────────────────────────────────────────── */

int can_set_group_filter(can_channel_t ch, uint32_t id_low,
                         uint32_t id_high, can_frame_type_t ft)
{
    if (ch > CAN_CHANNEL_2)       return CAN_ERR_INVALID_PARAM;
    if (id_low > id_high)          return CAN_ERR_INVALID_PARAM;

    if (ft == CAN_FRAME_STANDARD) {
        if (g_num_sff_grp >= MAX_STD_GRP_FILTERS) return CAN_ERR_FILTER_FULL;
        g_sff_grp[g_num_sff_grp].id_low  = id_low  & 0x7FFU;
        g_sff_grp[g_num_sff_grp].id_high = id_high & 0x7FFU;
        g_sff_grp[g_num_sff_grp].channel = (uint8_t)ch;
        g_sff_grp[g_num_sff_grp].active  = true;
        g_num_sff_grp++;
    } else {
        if (g_num_eff_grp >= MAX_EXT_GRP_FILTERS) return CAN_ERR_FILTER_FULL;
        g_eff_grp[g_num_eff_grp].id_low  = id_low  & 0x1FFFFFFFU;
        g_eff_grp[g_num_eff_grp].id_high = id_high & 0x1FFFFFFFU;
        g_eff_grp[g_num_eff_grp].channel = (uint8_t)ch;
        g_eff_grp[g_num_eff_grp].active  = true;
        g_num_eff_grp++;
    }

    af_rebuild();
    return CAN_OK;
}

int can_clear_filters(can_channel_t ch)
{
    (void)ch;  /* clears all filters (AF is shared) */
    g_num_sff     = 0;
    g_num_eff     = 0;
    g_num_sff_grp = 0;
    g_num_eff_grp = 0;
    g_filters_active = false;
    LPC_CANAF->AFMR = CAN_AFMR_ACCBP;   /* back to bypass */
    return CAN_OK;
}

/* ── Sleep / Wake ──────────────────────────────────────────── */

int can_sleep(can_channel_t ch)
{
    if (ch > CAN_CHANNEL_2)     return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized) return CAN_ERR_NOT_INIT;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);

    /* Enable wake-up interrupt so bus activity wakes us */
    pCAN->IER |= CAN_IER_WUIE;
    pCAN->MOD |= CAN_MOD_SM;
    return CAN_OK;
}

int can_wake(can_channel_t ch)
{
    if (ch > CAN_CHANNEL_2)     return CAN_ERR_INVALID_PARAM;
    if (!g_ctx[ch].initialized) return CAN_ERR_NOT_INIT;

    LPC_CAN_TypeDef *pCAN = can_periph(ch);
    pCAN->MOD &= ~CAN_MOD_SM;
    return CAN_OK;
}
